Repository: mostafasadeghidev/donations-custom-payment-with-woocommerce
Catalog: donations-custom-payment/languages/donations-custom-payment-*.po
Languages: fa_ir

source: Donations & Custom Payment
fa_ir: کمک‌های مالی و پرداخت سفارشی

source: Custom Payment
fa_ir: پرداخت سفارشی

source: Donations & Custom Payment requires WooCommerce to be installed and activated.
fa_ir: پلاگین پرداخت سفارشی و اهدا نیاز به نصب و فعال‌سازی ووکامرس دارد.

source: Advanced Custom Payment & Donation Plugin with WooCommerce - Create flexible payment forms with custom amounts. Perfect for charities, crowdfunding, custom payments, and installment sales on websites. Features comprehensive reporting system, full color customization, amount-containing links support, and responsive design. Use shortcode [custom_payment_form] anywhere.
fa_ir: پلاگین پیشرفته پرداخت سفارشی و اهدا به کمک ووکامرس - ایجاد فرم‌های پرداخت انعطاف‌پذیر با مبالغ دلخواه. مناسب برای خیریه‌ها، کراودفاندینگ و پرداخت‌های سفارشی و فروش اقساطی در سایت . شامل سیستم گزارش‌گیری جامع، سفارشی‌سازی کامل رنگ‌ها، پشتیبانی از لینک‌های حاوی مبلغ و طراحی ریسپانسیو. از شورت‌کد [custom_payment_form] استفاده کنید.

source: Please enter a valid amount between %1$s and %2$s %3$s.
fa_ir: لطفاً مبلغ معتبری بین %1$s تا %2$s %3$s وارد کنید.

source: Transparency:
fa_ir: شفافیت:

source: 💳 Payment Form
fa_ir: 💳 فرم پرداخت

source: 🚀 Continue Payment
fa_ir: 🚀 ادامه پرداخت

source: 💰 Amount (in Tomans)
fa_ir: 💰 مبلغ (به تومان)

source: ⚡ Suggested Amounts:
fa_ir: ⚡ مبالغ پیشنهادی:

source: Minimum:
fa_ir: حداقل:

source: Maximum:
fa_ir: حداکثر:

source: Please enter an amount.
fa_ir: لطفاً مبلغ را وارد کنید.

source: The entered amount is not valid. Please enter only numbers.
fa_ir: مبلغ وارد شده معتبر نیست. لطفاً فقط عدد وارد کنید.

source: Minimum payment amount is %s.
fa_ir: حداقل مبلغ قابل پرداخت %s است.

source: Maximum payment amount is %s.
fa_ir: حداکثر مبلغ قابل پرداخت %s است.

source: Custom Payment Form Settings
fa_ir: ⚙️ تنظیمات فرم پرداخت سفارشی

source: Custom Payment Form
fa_ir: فرم پرداخت سفارشی

source: Settings saved successfully!
fa_ir: تنظیمات با موفقیت ذخیره شد!

source: Minimum Amount (%s)
fa_ir: حداقل مبلغ (%s)

source: Maximum Amount (%s)
fa_ir: حداکثر مبلغ (%s)

source: Suggested Options
fa_ir: گزینه‌های پیشنهادی

source: Current Currency: %s
fa_ir: ارز فعلی: %s

source: 📝 How to Use:
fa_ir: 📝 نحوه استفاده:

source: To display the payment form on any page or post, use the shortcode below:
fa_ir: برای نمایش فرم پرداخت در هر صفحه یا پست، از شورت‌کد زیر استفاده کنید:

source: 🔗 Support for links containing amounts
fa_ir: 🔗 پشتیبانی از لینک‌های حاوی مبلغ

source: This plugin supports links containing amounts. Example:
fa_ir: این افزونه از لینک‌های حاوی مبلغ پشتیبانی می‌کند. مثال:

source: In this example, the amount 55000 is automatically placed in the amount field.
fa_ir: در این مثال، مبلغ 55000 به صورت خودکار در فیلد مبلغ قرار می‌گیرد.

source: Note:
fa_ir: نکته:

source: To use this feature, create a page or post with the name "pay" or any name you want, and place the shortcode in it.
fa_ir: برای استفاده از این قابلیت، یک برگه با نام "pay" یا هر نام دلخواهی که می‌خواهید ایجاد کنید و شورت‌کد را در آن قرار دهید.

source: ⚙️ General Settings
fa_ir: ⚙️ تنظیمات کلی

source: 📝 Texts and Titles
fa_ir: 📝 متون و عناوین

source: 🎨 Colors and Design
fa_ir: 🎨 رنگ‌ها و طراحی

source: 📊 Reports
fa_ir: 📊 گزارش‌ها

source: 💰 Amount Settings
fa_ir: 💰 تنظیمات مبلغ

source: 💱 Current Currency Information
fa_ir: 💱 اطلاعات ارز فعلی

source: Currency:
fa_ir: ارز:

source: Symbol:
fa_ir: نماد:

source: Position:
fa_ir: موقعیت:

source: Right
fa_ir: راست

source: Left
fa_ir: چپ

source: These settings are read from WooCommerce. For changes, refer to WooCommerce settings.
fa_ir: این تنظیمات از ووکامرس خوانده می‌شود. برای تغییر به تنظیمات ووکامرس مراجعه کنید.

source: Minimum payment amount by users
fa_ir: حداقل مبلغ قابل پرداخت توسط کاربران

source: Maximum payment amount by users
fa_ir: حداکثر مبلغ قابل پرداخت توسط کاربران

source: 🛒 Product Settings
fa_ir: 🛒 تنظیمات محصول

source: Product Name:
fa_ir: نام محصول:

source: The name that is displayed in the cart and invoice
fa_ir: نامی که در سبد خرید و صورتحساب نمایش داده می‌شود

source: ⚡ Suggested Amounts
fa_ir: ⚡ مبالغ پیشنهادی

source: Suggested Amounts:
fa_ir: مبالغ پیشنهادی:

source: Separate suggested amounts with commas. Example: %s
fa_ir: مبالغ پیشنهادی را با کاما جدا کنید. مثال: %s

source: These amounts will be displayed in your current currency (%s).
fa_ir: این مبالغ به ارز فعلی شما (%s) نمایش داده خواهند شد.

source: To disable this section, leave the content empty.
fa_ir: برای غیرفعال کردن این بخش، محتوا را خالی بگذارید.

source: Form Title:
fa_ir: عنوان فرم:

source: The title that is displayed at the top of the form (you can use emojis)
fa_ir: عنوانی که در بالای فرم نمایش داده می‌شود (می‌توانید emoji استفاده کنید)

source: Display Form Title:
fa_ir: نمایش عنوان فرم:

source: Display
fa_ir: نمایش دهید

source: Hide
fa_ir: مخفی کنید

source: Should the form title be displayed or not
fa_ir: آیا عنوان فرم نمایش داده شود یا نه

source: Payment Button Text:
fa_ir: متن دکمه پرداخت:

source: The text that is displayed on the payment button (you can use emojis)
fa_ir: متنی که روی دکمه پرداخت نمایش داده می‌شود (می‌توانید emoji استفاده کنید)

source: Amount Field Title:
fa_ir: عنوان فیلد مبلغ:

source: Amount Field Input Title (you can use emojis)
fa_ir: عنوان فیلد ورودی مبلغ (می‌توانید emoji استفاده کنید)

source: Display Minimum/Maximum:
fa_ir: نمایش اطلاعات حداقل/حداکثر:

source: Should minimum and maximum amounts be displayed under the input field
fa_ir: آیا حداقل و حداکثر مبالغ زیر فیلد ورودی نمایش داده شوند

source: Description Text:
fa_ir: متن توضیحات:

source: Additional description that is displayed under the amount field...
fa_ir: توضیحات اضافی که زیر فیلد مبلغ نمایش داده می‌شود...

source: Description text that is displayed under the amount field. You can write useful information, guidance, or necessary warnings here.
fa_ir: متن توضیحاتی که زیر فیلد مبلغ نمایش داده می‌شود. می‌توانید اطلاعات مفید، راهنمایی یا هشدارهای لازم را اینجا بنویسید.

source: For a new line, press Enter. Simple HTML is supported.
fa_ir: برای خط جدید، Enter بزنید. HTML ساده پشتیبانی می‌شود.

source: Display Description:
fa_ir: نمایش توضیحات:

source: Should the description be displayed in the form or not
fa_ir: آیا توضیحات در فرم نمایش داده شود یا نه

source: Suggested Amounts Text:
fa_ir: متن مبالغ پیشنهادی:

source: The text that is displayed above the suggested amounts buttons
fa_ir: متنی که بالای دکمه‌های مبالغ پیشنهادی نمایش داده می‌شود

source: Minimum Text:
fa_ir: متن حداقل:

source: Text displayed before the minimum amount
fa_ir: متنی که قبل از حداقل مبلغ نمایش داده می‌شود

source: Maximum Text:
fa_ir: متن حداکثر:

source: Text displayed before the maximum amount
fa_ir: متنی که قبل از حداکثر مبلغ نمایش داده می‌شود

source: 🎨 Background Colors
fa_ir: 🎨 رنگ‌های پس‌زمینه

source: Form Background Color:
fa_ir: رنگ پس‌زمینه فرم:

source: Select the main form background color
fa_ir: رنگ پس‌زمینه اصلی فرم را انتخاب کنید

source: Payment Button Color:
fa_ir: رنگ دکمه پرداخت:

source: Select the payment button background color
fa_ir: رنگ پس‌زمینه دکمه پرداخت را انتخاب کنید

source: Payment Field Background Color:
fa_ir: رنگ پس‌زمینه فیلد پرداخت:

source: Select the amount input field background color
fa_ir: رنگ پس‌زمینه فیلد ورودی مبلغ را انتخاب کنید

source: Description Background Color:
fa_ir: رنگ پس‌زمینه توضیحات:

source: Description Box Background Color
fa_ir: رنگ پس‌زمینه جعبه توضیحات

source: ✨ Text Colors
fa_ir: ✨ رنگ‌های متون

source: Form Title Color:
fa_ir: رنگ عنوان فرم:

source: Main Form Title Color
fa_ir: رنگ عنوان اصلی فرم

source: Amount Field Title Color:
fa_ir: رنگ عنوان فیلد مبلغ:

source: Amount Field Input Label Color
fa_ir: رنگ برچسب فیلد ورودی مبلغ

source: Amount Input Text Color:
fa_ir: رنگ متن ورودی مبلغ:

source: The color of the text entered by the user in the amount field
fa_ir: رنگ متنی که کاربر در فیلد مبلغ وارد می‌کند

source: Payment Button Text Color:
fa_ir: رنگ متن دکمه پرداخت:

source: Text on Payment Button
fa_ir: متن روی دکمه پرداخت

source: Description Text Color:
fa_ir: رنگ متن توضیحات:

source: Text inside Description Box
fa_ir: متن داخل جعبه توضیحات

source: Suggested Button Colors:
fa_ir: رنگ‌های دکمه پیشنهادی:

source: Suggested Button Colors
fa_ir: رنگ‌های دکمه پیشنهادی

source: Suggested Button Text Colors:
fa_ir: رنگ‌های متن دکمه پیشنهادی:

source: Text inside Suggested Button Colors
fa_ir: متن داخل رنگ‌های دکمه پیشنهادی

source: Amount Information Text Color:
fa_ir: رنگ متن اطلاعات مبلغ:

source: Text color for minimum and maximum amounts
fa_ir: رنگ متن برای حداقل و حداکثر مبالغ

source: All Orders
fa_ir: کل سفارش‌ها

source: Successful Orders
fa_ir: کل سفارش‌های موفق

source: Total Sales
fa_ir: مجموع فروش موفق

source: Average Sales
fa_ir: میانگین فروش موفق

source: 📅 Time Filter:
fa_ir: 📅 فیلتر زمانی:

source: All Times
fa_ir: همه زمان‌ها

source: Today
fa_ir: امروز

source: Last Week
fa_ir: هفته گذشته

source: Last Month
fa_ir: ماه گذشته

source: Last Year
fa_ir: سال گذشته

source: 🔍 Search:
fa_ir: 🔍 جستجو:

source: Name, email or order number...
fa_ir: نام، ایمیل یا شماره سفارش...

source: Apply Filter
fa_ir: اعمال فیلتر

source: Clear Filter
fa_ir: پاک کردن فیلتر

source: Order Number
fa_ir: شماره سفارش

source: Customer Name
fa_ir: نام مشتری

source: Email
fa_ir: ایمیل

source: Amount
fa_ir: مبلغ

source: Date
fa_ir: تاریخ

source: Status
fa_ir: وضعیت

source: Actions
fa_ir: عملیات

source: Completed
fa_ir: تکمیل شده

source: Processing
fa_ir: در حال پردازش

source: On Hold
fa_ir: در انتظار

source: Pending Payment
fa_ir: در انتظار پرداخت

source: Cancelled
fa_ir: لغو شده

source: Refunded
fa_ir: بازگردانده شده

source: Failed
fa_ir: ناموفق

source: 😔 No orders found
fa_ir: 😔 هیچ سفارشی یافت نشد

source: No orders have been registered in the selected time range or with the searched keyword.
fa_ir: در بازه زمانی انتخاب شده یا با کلیدواژه جستجو شده، سفارشی ثبت نشده است.

source: View
fa_ir: مشاهده

source: ← Previous
fa_ir: ← قبلی

source: Next →
fa_ir: بعدی →

source: Example: %s
fa_ir: مثال: %s

source: Save Settings
fa_ir: ذخیره تنظیمات

source: Reporting System Status:
fa_ir: وضعیت سیستم گزارش‌گیری:

source: Using HPOS tables (New)
fa_ir: استفاده از جداول HPOS (جدید)

source: Using traditional WordPress tables
fa_ir: استفاده از جداول سنتی وردپرس

source: Configure
fa_ir: پیکربندی

source: ⚙️ Custom Payment Form Settings
fa_ir: ⚙️ تنظیمات فرم پرداخت سفارشی

source: 📋 Current Product Information
fa_ir: 📋 اطلاعات محصول فعلی

source: Status:
fa_ir: وضعیت:

source: Product exists
fa_ir: محصول وجود دارد

source: Product does not exist
fa_ir: محصول وجود ندارد

source: Name displayed in cart and invoice
fa_ir: نام نمایش داده شده در سبد خرید و فاکتور

source: This name is read from the existing product in WooCommerce.
fa_ir: این نام از محصول موجود در ووکامرس خوانده می‌شود.

source: Short Description:
fa_ir: توضیحات کوتاه:

source: Short product description displayed in cart
fa_ir: توضیحات کوتاه محصول نمایش داده شده در سبد خرید

source: Product Image:
fa_ir: تصویر محصول:

source: No Image
fa_ir: بدون تصویر

source: Select Image
fa_ir: انتخاب تصویر

source: Remove Image
fa_ir: حذف تصویر

source: Product image displayed in cart and invoice
fa_ir: تصویر محصول نمایش داده شده در سبد خرید و فاکتور

source: 📝 Text and Title Settings
fa_ir: 📝 تنظیمات متن و عنوان

source: Title displayed at the top of the form (you can use emojis)
fa_ir: عنوان نمایش داده شده در بالای فرم (می‌توانید از ایموجی استفاده کنید)

source: Show Form Title:
fa_ir: نمایش عنوان فرم:

source: Show
fa_ir: نمایش

source: Whether to show the form title or not
fa_ir: آیا عنوان فرم نمایش داده شود یا نه

source: Text displayed on the payment button (you can use emojis)
fa_ir: متن نمایش داده شده روی دکمه پرداخت (می‌توانید از ایموجی استفاده کنید)

source: Amount Field Label:
fa_ir: برچسب فیلد مبلغ:

source: Label for the amount input field (you can use emojis)
fa_ir: برچسب فیلد ورودی مبلغ (می‌توانید از ایموجی استفاده کنید)

source: Show Min/Max Information:
fa_ir: نمایش اطلاعات حداقل/حداکثر:

source: Whether to show minimum and maximum amount information below the input field
fa_ir: آیا اطلاعات حداقل و حداکثر مبلغ زیر فیلد ورودی نمایش داده شود

source: Additional description displayed below the amount field...
fa_ir: توضیحات اضافی نمایش داده شده زیر فیلد مبلغ...

source: Description text displayed below the amount field. You can write useful information, guidance, or necessary warnings here.
fa_ir: متن توضیحات نمایش داده شده زیر فیلد مبلغ. می‌توانید اطلاعات مفید، راهنمایی یا هشدارهای لازم را اینجا بنویسید.

source: Press Enter for new line. Simple HTML is supported.
fa_ir: برای خط جدید Enter بزنید. HTML ساده پشتیبانی می‌شود.

source: Show Description:
fa_ir: نمایش توضیحات:

source: Whether to show description text in the form or not
fa_ir: آیا متن توضیحات در فرم نمایش داده شود یا نه

source: Text displayed above the suggested amount buttons
fa_ir: متن نمایش داده شده بالای دکمه‌های مبلغ پیشنهادی

source: Select the background color for the entire form
fa_ir: انتخاب رنگ پس‌زمینه کل فرم

source: Select the background color for the payment button
fa_ir: انتخاب رنگ پس‌زمینه دکمه پرداخت

source: Amount Field Background Color:
fa_ir: رنگ پس‌زمینه فیلد مبلغ:

source: Select the background color for the amount input field
fa_ir: انتخاب رنگ پس‌زمینه فیلد ورودی مبلغ

source: Background color of the description box
fa_ir: رنگ پس‌زمینه جعبه توضیحات

source: Color of the main form title text
fa_ir: رنگ متن عنوان اصلی فرم

source: Amount Field Label Color:
fa_ir: رنگ برچسب فیلد مبلغ:

source: Color of the amount input field label text
fa_ir: رنگ متن برچسب فیلد ورودی مبلغ

source: Color of the text that user enters in the amount field
fa_ir: رنگ متنی که کاربر در فیلد مبلغ وارد می‌کند

source: Color of the text on the payment button
fa_ir: رنگ متن روی دکمه پرداخت

source: Color of the text inside the description box
fa_ir: رنگ متن داخل جعبه توضیحات

source: Suggested Buttons Background Color:
fa_ir: رنگ پس‌زمینه دکمه‌های پیشنهادی:

source: Background color of the suggested amount buttons
fa_ir: رنگ پس‌زمینه دکمه‌های مبلغ پیشنهادی

source: Suggested Buttons Text Color:
fa_ir: رنگ متن دکمه‌های پیشنهادی:

source: Text color inside the suggested amount buttons
fa_ir: رنگ متن داخل دکمه‌های مبلغ پیشنهادی

source: Amount Info Text Color:
fa_ir: رنگ متن اطلاعات مبلغ:

source: Color of the text showing minimum and maximum amount
fa_ir: رنگ متنی که حداقل و حداکثر مبلغ را نشان می‌دهد

source: Minimum Amount (%s):
fa_ir: حداقل مبلغ (%s):

source: Maximum Amount (%s):
fa_ir: حداکثر مبلغ (%s):
